app/operations/bank_accounts/perform_transaction.rb

SELECT "bank_accounts".* FROM "bank_accounts" WHERE "bank_accounts"."id" = $1 ORDER BY "bank_accounts"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def initialize(amount:, transaction_type:, bank_account_id:)
      @amount = amount
      @transaction_type = transaction_type
      @bank_account_id = bank_account_id
      @bank_account = BankAccount.where(id: @bank_account_id).first

INSERT INTO "account_transactions" ("amount", "transaction_type", "transaction_number", "bank_account_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
UPDATE "bank_accounts" SET "balance" = $1, "updated_at" = $2 WHERE "bank_accounts"."id" = $3  [["balance", "10157.0"], ["updated_at", "2021-10-09 09:49:53.391983"], ["id", 1]]
UPDATE "bank_accounts" SET "balance" = $1, "updated_at" = $2 WHERE "bank_accounts"."id" = $3  [["balance", "50157.0"], ["updated_at", "2021-10-09 09:48:24.482417"], ["id", 1]]
---
    def execute!
      AccountTransaction.create!(
        bank_account: @bank_account,
        amount: @amount,
        transaction_type: @transaction_type
      )
      case @transaction_type
      when 'withdraw'
        @bank_account.update!(balance: @bank_account.balance - @amount)
      when 'deposit'
        @bank_account.update!(balance: @bank_account.balance + @amount)