app/operations/bank_accounts/validate_withdrawal.rb

      def initialize(amount:, transaction_type:, bank_account_id:)
        @amount = amount
        @transaction_type = transaction_type
        @bank_account_id = bank_account_id
        @bank_account = BankAccount.where(id: @bank_account_id).first
---
SELECT "bank_accounts".* FROM "bank_accounts" WHERE "bank_accounts"."id" = $1 ORDER BY "bank_accounts"."id" ASC LIMIT $2  [["id", -1], ["LIMIT", 1]]