app/controllers/api/v1/bank_accounts_controller.rb

SELECT "bank_accounts".* FROM "bank_accounts"
SELECT COUNT(*) FROM "bank_accounts"
---
      def new_withdraw
        amount = params[:amount]
        transaction_type = params[:transaction_type]
        bank_account_id = params[:bank_account_id]
        errors = ::BankAccounts::ValidateNewTransaction.new(
          amount: amount,
          transaction_type: transaction_type,
          bank_account_id: bank_account_id
        ).execute!
        if errors[0] == 'Account not found'
          render json: { errors: errors }, status: 402
        end
        if errors.empty?

SELECT "bank_accounts".* FROM "bank_accounts"
SELECT "users".* FROM "users"
---
      def index
        @accounts = BankAccount.all
        @users = User.all

INSERT INTO "bank_accounts" ("user_id", "balance", "account_number", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 4], ["balance", "0.0"], ["account_number", "8492738"], ["created_at", "2021-10-09 13:13:34.931524"], ["updated_at", "2021-10-09 13:13:34.931524"]]
---
      def create
        acc_number = BankAccount.create(bank_account_params)

SELECT COUNT(*) FROM "bank_accounts"
---
      def total_accounts
        number_accounts = BankAccount.count

SELECT COUNT(*) FROM "users"
---
      def total_users
        number_users = User.count