app/controllers/api/v1/registrations_controller.rb

SELECT "users".* FROM "users" ORDER BY created_at ASC
---
        def index
          users = User.order('created_at ASC')

INSERT INTO "users" ("first_name", "last_name", "middle_name", "email", "user_number", "address", "phone_number", "username", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"
---
        def create
          user = User.create(user_params)

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
UPDATE "users" SET "first_name" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["first_name", "JOSEPH"], ["updated_at", "2021-10-02 09:40:03.646416"], ["id", 5]]
---
        def update
          user = User.find(params[:id])
          if user.update_attributes(user_params)