app/controllers/api/v1/sessions_controller.rb

SELECT "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "ubaka"], ["LIMIT", 1]]
---
        def create
          user = User.find_by(username: session_params[:username])